class ErrnoHandle {
    public static errnoList = {
    1000: "缺少参数.",
    1001: '重复创建.',
    1002: "未能登录成功.",
    1003: "用户名或密码错误.",
    1007: "你选择了你未拥有的角色,请去商城购买.",
    1009: "角色信息非法.",
    1010: "你的玉石不足.",
    1011: "暂时无法找到对手.",
    1012: "期望一场已经开始的游戏但是不存在.",
    1013: "没有权限来访问资源.",
    1014: "请求超时.",
    1015: "玩家的状态异常.",
    1016: "在对战中出现了非法参数.",
    1017: "你的请求所附带的信息与你的socket不符合.",
    1018: "你只能与在线玩家聊天.",
    1019: "你想要添加的玩家不存在.",
    1020: "你请求了一个不存在的单人NPC数据.",
    1021: "你请求了一个不存在的剧情数据.",
    1022: "你请求了一个不存在的角色.",
    1023: "本次剧情无对战.",
    1024: "你请求选择卡牌,但是没有卡牌可供选择(单人对战结束时).",
    1025: "你的经验值不足,无法进入剧情.",
    1026: "你请求选择卡牌,但是你并未取得战斗胜利.",
    1027: "你请求了一个不存在的卡牌数据.",
    1028: "由于卡牌数量不足,无法生成卡包.",
    1029: "非法的卡牌数据.",
    1030: "牌库数量超出限制.",
    1031: "你的卡组数量已达上限.",
    1032: "太晚了,你的回合已经结束了.",
    1033: "你今天已经签到了.",
    1034: "你所请求的卡牌不存在.",
    //访问错误
    1004: "数据库操作异常,请稍后再试.",
    1005: "socket非法访问.",
    1006: "非法访问.",
    1008: "请求的数据不存在.",
    //微信接口出错
    2000: "微信登录异常,请重新登录",
    2001: "无法登录微信,请重新登录或联系客服."
    }
	constructor(errno){
        errno = parseInt(errno);
        if(isNaN(errno)){
            return ;
        }
        if(ErrnoHandle.errnoList[errno]){
            return ErrnoHandle.errnoList[errno];
        }
    }
}
